# coding: utf-8
import matplotlib.pyplot as plt
from matplotlib.image import imread

# step1. 准备数据 (一个示例图像)
img = imread("dataset/lena.png")  # 读入图像（设定合适的路径！）
print(img)
# [
#     [
#         [0.8745098  0.5294118  0.4745098 ]
#         [0.88235295 0.5372549  0.48235294]
#         [0.8862745  0.5411765  0.4862745 ]
#         ...
#         [0.93333334 0.5647059  0.5176471 ]
#         [0.94509804 0.59607846 0.53333336]
#         [0.8784314  0.5372549  0.47058824]
#     ]

#     [
#         [0.88235295 0.5372549  0.48235294]
#         [0.8862745  0.54509807 0.47843137]
#         [0.8901961  0.54509807 0.49019608]
#         ...
#         [0.92156863 0.5568628  0.5254902 ]
#         [0.9098039  0.5647059  0.5254902 ]
#         [0.827451   0.4862745  0.44705883]
#     ]

#     [
#         [0.8901961  0.5411765  0.47843137]
#         [0.8901961  0.5411765  0.47058824]
#         [0.89411765 0.54509807 0.48235294]
#         ...
#         [0.9372549  0.58431375 0.5803922 ]
#         [0.8980392  0.56078434 0.5568628 ]
#         [0.8039216  0.4745098  0.46666667]
#     ]

#         ...

#     [
#         [0.36078432 0.10588235 0.23921569]
#         [0.38431373 0.12156863 0.25882354]
#         [0.40392157 0.12941177 0.27450982]
#         ...
#         [0.53333336 0.2        0.2901961 ]
#         [0.58431375 0.24313726 0.31764707]
#         [0.6039216  0.2627451  0.32941177]
#     ]

#     [
#         [0.3529412  0.09803922 0.22352941]
#         [0.36862746 0.10588235 0.24313726]
#         [0.39215687 0.11764706 0.2627451 ]
#         ...
#         [0.5803922  0.23529412 0.32156864]
#         [0.6117647  0.2627451  0.33333334]
#         [0.6156863  0.27058825 0.33333334]
#     ]

#     [
#         [0.3372549  0.08235294 0.20784314]
#         [0.3529412  0.09019608 0.22745098]
#         [0.37254903 0.09803922 0.24313726]
#         ...
#         [0.63529414 0.29411766 0.36862746]
#         [0.6627451  0.30588236 0.3764706 ]
#         [0.6509804  0.29411766 0.36078432]
#     ]
# ]
print(type(img))  # <class 'numpy.ndarray'>
print(img.shape)  # (256, 256, 3)

# ! 注意区分两种显示图像的区别
# ✅ plt.imshow() 负责“把图像画到画布上，此时不弹窗显示出来”。在 Notebook 里，有时不写 plt.show() 也能显示图像，因为 notebook 会自动把当前 figure 渲染出来。
# ✅ plt.show() 负责“把画布窗口显示出来”
# step2. 【imshow 登场】：画家开始作画
# 此时，图像被绘制在了内存里的“后台画布”上
# 如果显示的是灰度图，最好指定 cmap="gray"，否则可能会默认以彩色显示
plt.imshow(img)
# 可选参数：
#   cmap: 颜色映射（灰度图常用）
#   vmin, vmax: 颜色映射范围，控制亮度范围（图像显示很关键）。告诉 matplotlib“像素值 0 是最黑，255 是最白”。尤其在做归一化、做差分图、做热力图时，这个非常关键。
#   interpolation: 插值方式（放大图像时影响很大）。"nearest"：不平滑，像素格子感强（适合看细节）；"bilinear"：更平滑（默认经常是这个）。
#   aspect: 宽高比
#   origin: 图像的坐标原点位置（做坐标相关操作时）。"upper"，默认：左上角是(0,0)；"lower"，左下角是(0,0)。
#   extent: 人为指定坐标轴范围，绘制图像的边界。如果想让图像的坐标不是像素坐标，而是某个实际范围：extent=[0, 10, 0, 5]
# plt.imshow(img, cmap="gray", vmin=0, vmax=255) # 显示灰度图

# 甚至可以在这里继续画别的东西，叠加在图片上
plt.title("This is a random map")  # 画标题

plt.savefig("ch01/lena.png")

# step3. 【show 登场】：经理把画挂出来
# 这一步才会真正弹出一个窗口
print("窗口即将弹出...")
# plt.show()
print("窗口已关闭")  # 只有当你关掉窗口，这行代码才会执行
